grevaillot/svd_tools/headers/STM32H7x5_CM4/adc1.h
#define ADC1_CR_BOOST_SHIFT		8
#define ADC1_CR_BOOST_MASK		0x03
/** @defgroup adc1_cr_boost BOOST Boost mode control
@{*/
/**@}*/

/** ADC1_CR_JADSTP ADC group injected conversion stop **/
#define ADC1_CR_JADSTP		(1 << 5)
/** ADC1_CR_ADSTP ADC group regular conversion stop **/
#define ADC1_CR_ADSTP		(1 << 4)
/** ADC1_CR_JADSTART ADC group injected conversion start **/
#define ADC1_CR_JADSTART		(1 << 3)
/** ADC1_CR_ADSTART ADC group regular conversion start **/
#define ADC1_CR_ADSTART		(1 << 2)
/** ADC1_CR_ADDIS ADC disable **/
#define ADC1_CR_ADDIS		(1 << 1)
/** ADC1_CR_ADEN ADC enable **/
#define ADC1_CR_ADEN		(1 << 0)

/**@}*/

/** @defgroup adc1_cfgr CFGR ADC configuration register 1
@{*/

/** ADC1_CFGR_JQDIS ADC group injected contexts queue disable **/
#define ADC1_CFGR_JQDIS		(1 << 31)

#define ADC1_CFGR_AWDCH1CH_SHIFT		26
#define ADC1_CFGR_AWDCH1CH_MASK		0x1f
/** @defgroup adc1_cfgr_awdch1ch AWDCH1CH ADC analog watchdog 1 monitored channel selection
@{*/
/**@}*/

/** ADC1_CFGR_JAUTO ADC group injected automatic trigger mode **/
#define ADC1_CFGR_JAUTO		(1 << 25)
/** ADC1_CFGR_JAWD1EN ADC analog watchdog 1 enable on scope ADC group injected **/
#define ADC1_CFGR_JAWD1EN		(1 << 24)
/** ADC1_CFGR_AWD1EN ADC analog watchdog 1 enable on scope ADC group regular **/
#define ADC1_CFGR_AWD1EN		(1 << 23)
/** ADC1_CFGR_AWD1SGL ADC analog watchdog 1 monitoring a single channel or all channels **/
#define ADC1_CFGR_AWD1SGL		(1 << 22)
/** ADC1_CFGR_JQM ADC group injected contexts queue mode **/
#define ADC1_CFGR_JQM		(1 << 21)
/** ADC1_CFGR_JDISCEN ADC group injected sequencer discontinuous mode **/
#define ADC1_CFGR_JDISCEN		(1 << 20)

#define ADC1_CFGR_DISCNUM_SHIFT		17
#define ADC1_CFGR_DISCNUM_MASK		0x07
/** @defgroup adc1_cfgr_discnum DISCNUM ADC group regular sequencer discontinuous number of ranks
@{*/
/**@}*/

/** ADC1_CFGR_DISCEN ADC group regular sequencer discontinuous mode **/
#define ADC1_CFGR_DISCEN		(1 << 16)
/** ADC1_CFGR_AUTDLY ADC low power auto wait **/
#define ADC1_CFGR_AUTDLY		(1 << 14)
/** ADC1_CFGR_CONT ADC group regular continuous conversion mode **/
#define ADC1_CFGR_CONT		(1 << 13)
/** ADC1_CFGR_OVRMOD ADC group regular overrun configuration **/
#define ADC1_CFGR_OVRMOD		(1 << 12)

#define ADC1_CFGR_EXTEN_SHIFT		10
#define ADC1_CFGR_EXTEN_MASK		0x03
/** @defgroup adc1_cfgr_exten EXTEN ADC group regular external trigger polarity
@{*/
/**@}*/


#define ADC1_CFGR_EXTSEL_SHIFT		5
#define ADC1_CFGR_EXTSEL_MASK		0x1f
/** @defgroup adc1_cfgr_extsel EXTSEL ADC group regular external trigger source
@{*/
/**@}*/


#define ADC1_CFGR_RES_SHIFT		2
#define ADC1_CFGR_RES_MASK		0x07
/** @defgroup adc1_cfgr_res RES ADC data resolution
@{*/
/**@}*/


#define ADC1_CFGR_DMNGT_SHIFT		0
#define ADC1_CFGR_DMNGT_MASK		0x03
/** @defgroup adc1_cfgr_dmngt DMNGT ADC DMA transfer enable
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_cfgr2 CFGR2 ADC configuration register 2
@{*/


#define ADC1_CFGR2_LSHIFT_SHIFT		28
#define ADC1_CFGR2_LSHIFT_MASK		0x0f
/** @defgroup adc1_cfgr2_lshift LSHIFT Left shift factor
@{*/
/**@}*/


#define ADC1_CFGR2_OSR_SHIFT		16
#define ADC1_CFGR2_OSR_MASK		0x3ff
/** @defgroup adc1_cfgr2_osr OSR Oversampling ratio
@{*/
/**@}*/

/** ADC1_CFGR2_RSHIFT4 Right-shift data after Offset 4 correction **/
#define ADC1_CFGR2_RSHIFT4		(1 << 14)
/** ADC1_CFGR2_RSHIFT3 Right-shift data after Offset 3 correction **/
#define ADC1_CFGR2_RSHIFT3		(1 << 13)
/** ADC1_CFGR2_RSHIFT2 Right-shift data after Offset 2 correction **/
#define ADC1_CFGR2_RSHIFT2		(1 << 12)
/** ADC1_CFGR2_RSHIFT1 Right-shift data after Offset 1 correction **/
#define ADC1_CFGR2_RSHIFT1		(1 << 11)
/** ADC1_CFGR2_ROVSM Regular Oversampling mode **/
#define ADC1_CFGR2_ROVSM		(1 << 10)
/** ADC1_CFGR2_TROVS ADC oversampling discontinuous mode (triggered mode) for ADC group regular **/
#define ADC1_CFGR2_TROVS		(1 << 9)

#define ADC1_CFGR2_OVSS_SHIFT		5
#define ADC1_CFGR2_OVSS_MASK		0x0f
/** @defgroup adc1_cfgr2_ovss OVSS ADC oversampling shift
@{*/
/**@}*/

/** ADC1_CFGR2_JOVSE ADC oversampler enable on scope ADC group injected **/
#define ADC1_CFGR2_JOVSE		(1 << 1)
/** ADC1_CFGR2_ROVSE ADC oversampler enable on scope ADC group regular **/
#define ADC1_CFGR2_ROVSE		(1 << 0)

/**@}*/

/** @defgroup adc1_smpr1 SMPR1 ADC sampling time register 1
@{*/


#define ADC1_SMPR1_SMP9_SHIFT		27
#define ADC1_SMPR1_SMP9_MASK		0x07
/** @defgroup adc1_smpr1_smp9 SMP9 ADC channel 9 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP8_SHIFT		24
#define ADC1_SMPR1_SMP8_MASK		0x07
/** @defgroup adc1_smpr1_smp8 SMP8 ADC channel 8 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP7_SHIFT		21
#define ADC1_SMPR1_SMP7_MASK		0x07
/** @defgroup adc1_smpr1_smp7 SMP7 ADC channel 7 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP6_SHIFT		18
#define ADC1_SMPR1_SMP6_MASK		0x07
/** @defgroup adc1_smpr1_smp6 SMP6 ADC channel 6 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP5_SHIFT		15
#define ADC1_SMPR1_SMP5_MASK		0x07
/** @defgroup adc1_smpr1_smp5 SMP5 ADC channel 5 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP4_SHIFT		12
#define ADC1_SMPR1_SMP4_MASK		0x07
/** @defgroup adc1_smpr1_smp4 SMP4 ADC channel 4 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP3_SHIFT		9
#define ADC1_SMPR1_SMP3_MASK		0x07
/** @defgroup adc1_smpr1_smp3 SMP3 ADC channel 3 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP2_SHIFT		6
#define ADC1_SMPR1_SMP2_MASK		0x07
/** @defgroup adc1_smpr1_smp2 SMP2 ADC channel 2 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR1_SMP1_SHIFT		3
#define ADC1_SMPR1_SMP1_MASK		0x07
/** @defgroup adc1_smpr1_smp1 SMP1 ADC channel 1 sampling time selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_smpr2 SMPR2 ADC sampling time register 2
@{*/


#define ADC1_SMPR2_SMP19_SHIFT		27
#define ADC1_SMPR2_SMP19_MASK		0x07
/** @defgroup adc1_smpr2_smp19 SMP19 ADC channel 18 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR2_SMP18_SHIFT		24
#define ADC1_SMPR2_SMP18_MASK		0x07
/** @defgroup adc1_smpr2_smp18 SMP18 ADC channel 18 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR2_SMP17_SHIFT		21
#define ADC1_SMPR2_SMP17_MASK		0x07
/** @defgroup adc1_smpr2_smp17 SMP17 ADC channel 17 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR2_SMP16_SHIFT		18
#define ADC1_SMPR2_SMP16_MASK		0x07
/** @defgroup adc1_smpr2_smp16 SMP16 ADC channel 16 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR2_SMP15_SHIFT		15
#define ADC1_SMPR2_SMP15_MASK		0x07
/** @defgroup adc1_smpr2_smp15 SMP15 ADC channel 15 sampling time selection
@{*/
/**@}*/


#define ADC1_SMPR2_SMP14_SHIFT		12
#define ADC1_SMPR2_SMP14_MASK		0x07
/** @defgroup adc1_smpr2_smp14 SMP14 ADC channel 14 sampling time selection
@{*/
/**@}*/


